Repository: standardsats/esplora
Catalog: lang/*.po
Languages: th

source: Address
th: ที่อยู่

source: Address reuse
th: การใช้ที่อยู่ซ้ำ

source: Address: %s
th: ที่อยู่: %0

source: Amount commitment
th: จำนวนความมุ่งมั่น

source: Asset commitment
th: ความมุ่งมั่นของสินทรัพย์

source: Asset ID
th: รหัสสินทรัพย์

source: Bits
th: บิต

source: Block Challenge
th: การท้าทายบล็อค

source: Block height
th: ความสูงของบล็อค

source: Block not found
th: ไม่พบบล็อค

source: Block %s
th: บล็อค %0

source: Block Solution
th: โซลูชั่นบล็อค

source: Block #%s: %s
th: บล็อค #%0: %1

source: Block timestamp
th: เวลาบันทึกบล็อค

source: Broadcast raw transaction (hex)
th: สร้างการทำธุรกรรมดิบ (hex)

source: Broadcast transaction
th: ส่งประกาศการทำธุรกรรม

source: Broadcast tx
th: ส่งประกาศ tx

source: Cancel
th: ยกเลิก

source: CoinJoin transactions hide the link between inputs and outputs and improves Bitcoin's overall privacy and fungibility for everyone.
th: การทำธุรกรรม CoinJoin ซ่อนการเชื่อมโยงระหว่างข้อมูลนำเข้าและผลลัพธ์ และเพิ่มประสิทธิภาพในการคุ้มครองความเป็นส่วนตัวของบิตคอยน์และการสามารถแลกเปลี่ยนได้สำหรับทุกคน

source: compared to bitcoind's suggested fee of %s nano eTHB for confirmation within 2 blocks
th: เมื่อเทียบกับค่าธรรมเนียมที่ bitcoind แนะนำที่ %0 nano eTHB สำหรับการยืนยันภายใน 2 บล็อก

source: Confidential
th: ความลับ

source: Confirmed
th: ยืนยันแล้ว

source: Confirmed received
th: ยืนยันการรับแล้ว

source: Confirmed spent
th: ยืนยันการใช้จ่ายแล้ว

source: Confirmed tx count
th: จำนวนการยืนยัน tx

source: Confirmed unspent
th: ยืนยันที่ยังไม่ได้ใช้จ่าย

source: Currently unavailable
th: ไม่สามารถใช้งานได้ในขณะนี้

source: Details
th: รายละเอียด

source: Esplora is currently unavailable, please try again later.
th: Esplora ไม่สามารถใช้งานได้ในขณะนี้ โปรดลองอีกครั้งในภายหลัง

source: Fee
th: ค่าธรรมเนียม

source: Go
th: ไป

source: Height
th: ความสูง

source: In best chain
th: ในสายที่ดีที่สุด

source: In best chain (%s confirmations) (singular)
th: ในสายที่ดีที่สุด (1 การยืนยัน)

source: In best chain (%s confirmations) (plural)
th: ในสายที่ดีที่สุด (%0 การยืนยัน)

source: Included in Block
th: รวมอยู่ในบล็อก

source: in %s blocks (%s from tip)
th: ใน %0 บล็อก (%1 จากทิป)

source: Issuance
th: การออก

source: Issuance amount
th: จำนวนการออก

source: It is possible to tell the change output apart because you're sending to a different script type than the one you're spending from.
th: เป็นไปได้ที่จะบอกความแตกต่างของผลลัพธ์การเปลี่ยนเพราะคุณกำลังส่งไปยังสคริปต์ประเภทที่แตกต่างจากที่คุณใช้จ่าย

source: lang_id
th: th

source: lang_name
th: ไทย

source: Likely self-transfer
th: การโอนเงินด้วยตนเองที่เป็นไปได้

source: Loading...
th: กำลังโหลด...

source: Load more
th: โหลดเพิ่มเติม

source: Lock time
th: เวลาล็อก

source: Merkle root
th: รากของ Merkle

source: New asset
th: สินทรัพย์ใหม่

source: Newer
th: ใหม่กว่า

source: Next
th: ถัดไป

source: Nonstandard
th: ไม่เป็นมาตรฐาน

source: No outputs
th: ไม่มีผลลัพธ์

source: No recent transactions
th: ไม่มีการทำธุรกรรมเร็ว ๆ นี้

source: No reissuance
th: ไม่มีการออกใหม่

source: No results found
th: ไม่พบผลลัพธ์

source: Older
th: เก่ากว่า

source: OP_RETURN data
th: ข้อมูล OP_RETURN

source: Opted in
th: เลือกเข้าร่วม

source: Orphaned
th: เป็นกำมะถัน

source: Outpoint
th: จุดออก

source: Output in parent chain
th: ผลลัพธ์ในสายแม่

source: overpaying by %s%
th: จ่ายเกิน %s%

source: Page Not Found
th: ไม่พบหน้าที่ร้องขอ

source: Peg-out address
th: ที่อยู่ Peg-out

source: Peg-out to
th: Peg-out ไปยัง

source: Possibly a CoinJoin transaction
th: อาจเป็นการทำธุรกรรม CoinJoin

source: Powered by esplora
th: ขับเคลื่อนโดย esplora

source: Prev
th: ก่อนหน้า

source: Previous
th: ก่อนหน้า

source: Previous output address
th: ที่อยู่ผลลัพธ์ก่อนหน้า

source: Previous output script
th: สคริปต์ผลลัพธ์ก่อนหน้า

source: Privacy analysis
th: การวิเคราะห์ความเป็นส่วนตัว

source: Recent transactions
th: การทำธุรกรรมเร็วๆนี้

source: Reissuance
th: การออกใหม่

source: Reissuance commitment
th: ความมั่นใจในการออกใหม่

source: Reissuance keys
th: กุญแจการออกใหม่

source: Replace by fee
th: แทนที่ด้วยค่าธรรมเนียม

source: Round payment amount
th: จำนวนการชำระเงินแบบรอบ

source: %s blocks
th: %0 บล็อก

source: Scan QR
th: สแกน QR

source: %s Confirmations (singular)
th: 1 การยืนยัน

source: %s Confirmations (plural)
th: %0 การยืนยัน

source: Search for block height, hash, transaction, or address
th: ค้นหาด้วยความสูงบล็อก, แฮช, ธุรกรรม หรือ ที่อยู่

source: SegWit fee savings
th: การประหยัดค่าธรรมเนียม SegWit

source: Sending exact amounts (with no change) is an indication the bitcoins likely didn't change hands.
th: การส่งจำนวนเงินที่แน่นอน (ไม่มีเงินทอน) แสดงว่าบิตคอยน์น่าจะไม่ได้เปลี่ยนแปลงเจ้าของ.

source: Sending to a different script type
th: การส่งไปยังประเภทสคริปต์ที่แตกต่าง

source: %s from tip
th: %0 จากทิป

source: Size
th: ขนาด

source: Size (KB)
th: ขนาด (KB)

source: %s of %s Transactions
th: %0 จาก %1 ธุรกรรม

source: %s outputs (singular)
th: 1 ผลลัพธ์

source: %s outputs (plural)
th: %0 ผลลัพธ์

source: Spending tx
th: การใช้จ่าย tx

source: Spent by
th: ใช้โดย

source: Status
th: สถานะ

source: %s Transactions (singular)
th: 1 ธุรกรรม

source: %s Transactions (plural)
th: %0 ธุรกรรม

source: There's an indication that one output is more likely to be the change because some inputs would've been unnecessary if it was the payment.
th: มีการบ่งบอกว่าผลลัพธ์หนึ่งอาจเป็นเงินทอน เนื่องจากบางอินพุตอาจไม่จำเป็นหากเป็นการชำระเงิน.

source: This transaction could save %s on fees by upgrading to native SegWit-Bech32 or %s by upgrading to SegWit-P2SH
th: ธุรกรรมนี้สามารถประหยัดค่าธรรมเนียมได้ %0 ด้วยการอัพเกรดเป็น SegWit-Bech32 แบบเดิม หรือ %1 ด้วยการอัพเกรดเป็น SegWit-P2SH

source: This transaction doesn't violate any of the privacy gotchas we cover. Read on other potential ways it might leak privacy.
th: ธุรกรรมนี้ไม่ละเมิดข้อจับใจด้านความเป็นส่วนตัวที่เราอธิบาย อ่านเกี่ยวกับวิธีอื่นๆที่อาจเปิดเผยความเป็นส่วนตัว.

source: This transaction has unnecessary inputs that are not typically added by wallet software.
th: ธุรกรรมนี้มีอินพุตที่ไม่จำเป็น ซึ่งโดยปกติไม่ได้ถูกเพิ่มโดยซอฟต์แวร์กระเป๋า.

source: This transaction re-uses addresses. This makes it trivial to track your transactions over time and link them together. Note that we currently only look for address reuse within the transaction, not across the history.
th: ธุรกรรมนี้ใช้ที่อยู่ซ้ำ ทำให้เป็นเรื่องง่ายที่จะติดตามการทำธุรกรรมของคุณตลอดเวลา และเชื่อมโยงกัน โปรดทราบว่าเราเฉพาะการค้นหาการใช้ที่อยู่ซ้ำภายในธุรกรรมเท่านั้น ไม่ได้เป็นข้ามประวัติ.

source: This transaction saved %s on fees by upgrading to native SegWit-Bech32
th: ธุรกรรมนี้ประหยัดค่าธรรมเนียม %0 ด้วยการอัพเกรดเป็น SegWit-Bech32 แบบเดิม

source: This transaction saved %s on fees by upgrading to SegWit and could save %s more by fully upgrading to native SegWit-Bech32
th: ธุรกรรมนี้ประหยัดค่าธรรมเนียม %0 ด้วยการอัพเกรดเป็น SegWit และยังสามารถประหยัดเพิ่มเติมได้ %1 หากอัพเกรดเต็มรูปแบบเป็น SegWit-Bech32 แบบเดิม

source: Timestamp
th: เวลาที่บันทึก

source: Total fees
th: ค่าธรรมเนียมรวม

source: Total size
th: ขนาดรวม

source: Total transactions
th: ธุรกรรมรวม

source: Total tx count
th: จำนวนธุรกรรมรวม

source: Total unspent
th: ยอดคงเหลือรวม

source: Transaction
th: ธุรกรรม

source: Transaction fees
th: ค่าธรรมเนียมธุรกรรม

source: Transaction not found
th: ไม่พบธุรกรรม

source: Transactions
th: ธุรกรรม

source: Transaction: %s
th: ธุรกรรม: %0

source: Type
th: ประเภท

source: Unconfirmed
th: ยังไม่ได้ยืนยัน

source: Unconfirmed received
th: ได้รับโดยยังไม่ได้ยืนยัน

source: Unconfirmed spent
th: ใช้จ่ายโดยยังไม่ได้ยืนยัน

source: Unconfirmed tx count
th: จำนวนธุรกรรมที่ยังไม่ได้ยืนยัน

source: Unnecessary input heuristic
th: ฮิวริสติกของอินพุตที่ไม่จำเป็น

source: Unspent
th: ยังไม่ได้ใช้จ่าย

source: Using round payment amounts gives an indication of which output is the payment and which is the change. Padding payment amounts to use all available precision resolves this issue.
th: การใช้จำนวนการชำระเงินแบบกลมช่วยบ่งบอกว่าผลลัพธ์ใดเป็นการชำระเงินและผลลัพธ์ใดเป็นเงินทอน การเติมจำนวนการชำระเงินเพื่อใช้ความแม่นยำที่มีทั้งหมดจะแก้ไขปัญหานี้

source: Value
th: มูลค่า

source: Value commitment
th: ความมุ่งมั่นของมูลค่า

source: Version
th: เวอร์ชัน

source: Virtual size
th: ขนาดเสมือนจริง

source: We encountered an error. Please try again later.
th: เราพบข้อผิดพลาด โปรดลองใหม่ภายหลัง

source: Weight (KWU)
th: น้ำหนัก (KWU)

source: Weight units
th: หน่วยน้ำหนัก

source: Witness
th: พยาน
